# Setup

Within this section, we provide the commands to setup the local SQL environment.

In [1]:
!pip install ipython-sql sqlalchemy

Requirement already satisfied: ipython-sql in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (0.4.0)
Requirement already satisfied: sqlalchemy in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (1.4.37)
Requirement already satisfied: sqlparse in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: six in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: ipython>=1.0 in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from ipython-sql) (8.3.0)
Requirement already satisfied: prettytable<1 in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: greenlet!=0.4.17 in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from sqlalchemy) (1.1.2)
Requirement already satisfied: pickleshare in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: backcall in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: stack-data in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (0.1.3)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (3.0.29)
Requirement already satisfied: decorator in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: appnope in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (0.1.3)
Requirement already satisfied: traitlets>=5 in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (5.2.1.post0)
Requirement already satisfied: pygments>=2.4.0 in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (2.12.0)
Requirement already satisfied: setuptools>=18.5 in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (62.3.2)
Requirement already satisfied: jedi>=0.16 in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (0.18.1)
Requirement already satisfied: pexpect>4.3 in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from ipython>=1.0->ipython-sql) (4.8.0)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: ptyprocess>=0.5 in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from pexpect>4.3->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: asttokens in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from stack-data->ipython>=1.0->ipython-sql) (2.0.5)
Requirement already satisfied: executing in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: pure-eval in /Applications/anaconda3/envs/ds/lib/python3.10/site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.2.2)

Next, please load the SQL magic extension.

In [2]:
%load_ext sql

# Exercise 1: Batter - Setup

## a

Download the Lahman baseball data set from: <https://github.com/jknecht/baseball-archive-sqlite/blob/master/lahman2016.sqlite?raw=true> using `!curl -Os <url>` command.

In [29]:
# code here
#!curl -Os https://github.com/jknecht/baseball-archive-sqlite/blob/master/lahman2016.sqlite
!curl -Os https://github.com/jknecht/baseball-archive-sqlite/raw/master/lahman2016.sqlite

## b

Create a connection to the `lahman2016.sqlite` SQLite database.

In [30]:
# Python code here
%sql sqlite:///lahman2016.sqlite

## c

List all the tables that are inside the database.

In [31]:
%%sql
SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///lahman2016.sqlite
Done.

[]

In [27]:
%%sql
SELECT 
    name
FROM 
    sqlite_master
WHERE 
    type ='table' AND 
    name NOT LIKE 'sqlite_%';

 * sqlite:///lahman2016.sqlite
Done.

[]

## d

What are the names of all the columns in the `Salaries` and `Teams` tables?

In [ ]:
%%sql 
SELECT name FROM Salaries,Teams;
-- SQL code here

## e

Retrieve the `salaries` table and bring it into *Jupyter* using the same name.

_Hint:_ Use the `_` symbol and `.DataFrame()` to store the query results in `salaries` so that the SQL Table results is available in *Jupyter*.

In [ ]:
%%sql 
salaries = _.DataFrame()
-- SQL code here

In [ ]:
# Python code here

# Exercise 2: Batter - Querying

## a

Create a SQL query embedded in *Jupyter* that counts the average number of home runs in the entire `Batting` table.

*Hints*:

-   You will need to use: `SELECT`, `AVG`, and `AS`.
-   The result should only contain **one** field -- `average_hr` -- and **1** record.

In [ ]:
%%sql 

-- SQL code here

## b

Improve the SQL query developed in **b** and embedded in the *Jupyter* document by:

-   calculating the average for **each team**,
-   show only teams that have an average equal to or greater than **3.5**, and
-   listing the name of the team.

*Hints*:

-   You will need to use: `SELECT`, `AVG`, `AS`, `JOIN`, `GROUP BY`, and `HAVING`.
-   The result should only contain **two** fields -- `name` and `average_hr` -- and **16** records.
-   The `name` column in `Teams` contains the team name.
    -   Join the `Teams` and `Batting` tables by `teamID` and `yearID`.
-   To handle the `ambiguous column name` error requires specifying the table name prior to using the variable in the `SELECT ...` portion, e.g. `table.variable`

In [ ]:
%%sql 

-- SQL code here

## c

Modify the **c** SQL query embedded in *Jupyter* so that it tabulates the average number of home runs for each player in the `Batting` table:

-   **from 1975 onwards**,
-   **takes only players with an overall average number of homeruns to be greater than 10**, and
-   **sorts them in descending order**.

*Hints*:

-   You will need to use: `SELECT`, `AVG()`, `AS`, `WHERE`, `GROUP BY`, `HAVING`, `ORDER BY`, and `DESC`.
-   The result should only contain **two** fields -- `playerID` and `average_hr` -- and **548** records.
-   Recall the difference between `HAVING` and `WHERE`.

In [ ]:
%%sql 

-- SQL code here

# Exercise 3: Batter - Compute and Retrieve

## a

Write a SQL query embedded in *Jupyter* that computes the total salary expenditures for each team for the year 2016.

*Hints*:

-   You will need to use: `SELECT`, `SUM`, `AS`, `WHERE`, and `GROUP BY`.
-   The result should only contain **two** fields -- `teamID` and `total_salary` -- and **30** records.
-   Use the `_` symbol and `.DataFrame()` to store the query results in `salary_teamid_info` so that the SQL Table results is available in *Jupyter*.

In [ ]:
%%sql 

-- SQL code here

## b

Graph the results from **a** on a bar plot created using [`sns.countplot()`](https://seaborn.pydata.org/generated/seaborn.countplot.html#seaborn.countplot) from [`seaborn`](https://seaborn.pydata.org/). Consider looking at examples on [Python Graph Gallery](https://www.python-graph-gallery.com/) for help in constructing the plot.

By looking at the graph, what team had the highest payouts to their players in 2016?

*Hint*: Rotate text on the x-axis of the plot with `plt.xticks(rotation=45)`.

In [ ]:
%%sql 

-- SQL code here

In [ ]:
# Python code here

## c

Instead of calculating only a single year, compute the total salaries for each year spanning from 1990 to 2016. Graph the result on a line plot using [`sns.lineplot()`](https://seaborn.pydata.org/generated/seaborn.lineplot.html#seaborn.lineplot) from [`seaborn`](https://seaborn.pydata.org//). Graph each team's line in a different column.

*Hints*:

-   You will need to use: `SELECT`, `SUM`, `AS`, `WHERE`, and `GROUP BY`.
    -   Psst, to specify multiple groups place a comma between them!
-   The result should only contain **three** fields -- `teamID`, `yearID`, and `total_salary` -- and **788** records.
-   Use the `_` symbol and `.DataFrame()` to store the query results in `salary_teamid_yearly` so that the SQL Table results is available in *Jupyter*.

In [ ]:
%%sql 

-- SQL code here

In [ ]:
# Python code here

# Exercise 4: INSERT, INSERT, INSERT

Uh oh, it looks like a delete command accidentally removed all of the observations and the `people` table itself from the database! Please re-populate the database by re-creating the `people` table with entries shown below:

In [3]:
# Problem setup code
import numpy as np
import pandas as pd

df = pd.DataFrame({
"FirstName": ["Tim", "Elon", "Arnie", "Larry", "Angelina"],
"LastName": ["Apple", "Tusk", "Sharwtz", "Hanks", "Voight"],
"Age": [61, 50, 74, 69, 46],
"Height": [5.6, 6.2, 6.2, 5.1, 5.7],
"Job": ["CEO", "Evil Genius", "Governator", "Professor", "Actress"],
})

display(df)

  FirstName LastName  Age  Height          Job
0       Tim    Apple   61     5.6          CEO
1      Elon     Tusk   50     6.2  Evil Genius
2     Arnie  Sharwtz   74     6.2   Governator
3     Larry    Hanks   69     5.1    Professor
4  Angelina   Voight   46     5.7      Actress

Fields are given as: `FirstName`, `LastName`, `Age`, `Height`, and `Job`

**Note:** Please do not include the index on the left-hand side as there is no field name present.

In [21]:
# Problem setup code
%sql sqlite:///recreate-and-insert-problem.db

'Connected: @recreate-and-insert-problem.db'

----

In [22]:
%%sql 

-- SQL code here

   sqlite:///:memory:
 * sqlite:///recreate-and-insert-problem.db
   sqlite:///transform-problem.db
0 rows affected.

[]

# Exercise 5: Going to the Center of the Earth

The form field populating the database accidentally allowed _positive values_ when **only negative values** should be present. 

Using an `UPDATE` query, please correct the `formdata` table to have only **negative values**.

The `formdata` table has fields `record` and `value`. Inside of `formdata`, we have:

In [9]:
# Problem setup code

import numpy as np
import pandas as pd 

n = np.random.randint(5, 12, 1)[0]
df = pd.DataFrame({
    "record": np.arange(1, n + 1, 1),
    "value": np.random.randint(-50, 100, n)
})

# Force at least one positive value
df.iat[n - 1, 1] = np.random.randint(1, 50, 1)[0]

# Show the data frame
display(df)

    record  value
0        1    -18
1        2    -30
2        3     43
3        4     -4
4        5     23
5        6     72
6        7     41
7        8      6
8        9      0
9       10     78
10      11     10

The transformed table should look like:

In [8]:
# Copy
df_transformed = df.copy()

# Transform
df_transformed["value"] = df_transformed["value"].apply(lambda x: -1*abs(x))

# Show transformed data frame
display(df_transformed)

   record  value
0       1     -7
1       2     -9
2       3    -43
3       4    -24
4       5    -28
5       6    -28
6       7    -11
7       8    -19

Please make sure that the field names in the output match the field names in original table.

In [19]:
# Problem setup code

# Import Pandas Data into SQL
%sql sqlite:///transform-problem.db
import sqlalchemy

engine = sqlalchemy.create_engine('sqlite:///transform-problem.db')
df.to_sql('formdata', engine, if_exists = 'replace', index = False)

----

In [20]:
%%sql

-- SQL code here
SELECT * FROM formdata

   sqlite:///:memory:
 * sqlite:///transform-problem.db
Done.

[(1, -18),
 (2, -30),
 (3, 43),
 (4, -4),
 (5, 23),
 (6, 72),
 (7, 41),
 (8, 6),
 (9, 0),
 (10, 78),
 (11, 10)]

# Exercise 6: Shipping Quandaries

Calculate the total amount of packages shipped to all users every month across the years based on data in the `packages` table. 

To obtain the month by year breakdown, please concatenate or combine the `month` and `year` fields into the `mm_yyyy` field with a space as a separator, e.g. `9 2018`.

Please return the `mm_yyyy` field followed by a total count of packages `pkg_total` for the month under the given year. Make sure to perform a grouping statement using `mm_yyyy`.

Example `packages` table:

In [23]:
# Problem setup code

import numpy as np 
import random 

N = random.randint(4, 12 + 1)
user_id = random.sample(list(range(1, N + 1)), N)
package_id = list(range(1, N + 1))

year = random.choices(list(range(2015, 2021)), k = N)
month = random.choices(list(range(1, 13)), k = N)

weight = random.choices(range(3, 20, 1), k=N)

df = pd.DataFrame({
  'user_id': user_id,
  'package_id': package_id,
  'month': month,
  'year': year,
  'weight': weight
})

display(df)

   user_id  package_id  month  year  weight
0        7           1     11  2020       7
1        1           2     12  2017      15
2        2           3     10  2016      10
3        4           4     10  2016      12
4        8           5     11  2020       4
5        6           6      1  2020      15
6        3           7      3  2016      17
7        5           8      9  2020      16

_Hint:_ You may wish to combine the month and year column using SQLites concatenate operator `||`, e.g.

```sql
SELECT first_name || ' ' || last_name AS full_name
```

Gives: 

```
full_name
John Smith
Peter Jones
```

In [24]:
# Problem setup code

# Import Pandas data into SQL
%sql sqlite:///package-shipped-problem.db
import sqlalchemy

engine = sqlalchemy.create_engine('sqlite:///package-shipped-problem.db')
df.to_sql('packages', engine, if_exists = 'replace', index = False)

----

In [25]:
%%sql

-- SQL code here
SELECT * FROM packages

   sqlite:///:memory:
 * sqlite:///package-shipped-problem.db
   sqlite:///recreate-and-insert-problem.db
   sqlite:///transform-problem.db
Done.

[(7, 1, 11, 2020, 7),
 (1, 2, 12, 2017, 15),
 (2, 3, 10, 2016, 10),
 (4, 4, 10, 2016, 12),
 (8, 5, 11, 2020, 4),
 (6, 6, 1, 2020, 15),
 (3, 7, 3, 2016, 17),
 (5, 8, 9, 2020, 16)]